Revit 2024 API
BuiltInFailures.ZoneFailures.ZoneExistsNotEnclosedRoom Property
 Zone has a room not enclosed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ZoneExistsNotEnclosedRoom { get; }
Visual Basic
Public Shared ReadOnly Property ZoneExistsNotEnclosedRoom As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ZoneExistsNotEnclosedRoom {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ZoneFailures Class
Autodesk.Revit.DB Namespace